In [ ]:
#basic syntax
lambda arguments : expression

In [21]:
#scaler aplication

lambda x: x+2

In [24]:
add= lambda x: x+2
add(3)

5

In [25]:
add= lambda x,y: x+y
add(4,7)

11

In [26]:
multiply= lambda x: x*5
multiply(3)

15

In [28]:
(lambda x: x*5)(7)

35

In [ ]:
#list application

filter(function, iterable)
map(function, iterable)

In [ ]:
#filter
test_list = [1,2,3,4,5,6,7,8,9]

In [29]:
#filter for odd numbers
#filter(function, iterable)
filter(lambda x: x%2==1, test_list)

In [30]:
list(filter(lambda x: x%2==1, test_list))

[1, 3, 5, 7, 9]

In [ ]:
#map

In [34]:
#map input by power of numbers

test_list = [1,2,3,4,5,6,7,8,9]

'''
map(function, iterable)
'''
map(lambda x:pow(x,2),test_list)

In [36]:
list(map(lambda x:pow(x,3),test_list))

[1, 8, 27, 64, 125, 216, 343, 512, 729]

In [37]:
#Apply lambdas to files
import pandas as pd
df = pd.DataFrame({
    'Name': ['Frank','George','Steve','Julian'],
    'Height': [5, 6, 4, 5],
    'Birthyear': [1986, 1985, 2010, 2016],
})


df

     Name  Height  Birthyear
0   Frank       5       1986
1  George       6       1985
2   Steve       4       2010
3  Julian       5       2016

In [38]:
df['Age']=df['Birthyear'].apply(lambda x: 2022-x)
df

     Name  Height  Birthyear  Age
0   Frank       5       1986   36
1  George       6       1985   37
2   Steve       4       2010   12
3  Julian       5       2016    6